# VSCode Extensions List
# This file contains all installed VSCode extensions
# Install all extensions: cat extensions.txt | grep -v "^#" | xargs -L 1 code --install-extension

# ============================================
# AWS & Cloud
# ============================================
amazonwebservices.aws-toolkit-vscode
hashicorp.terraform

# ============================================
# AI & Copilot
# ============================================
anthropic.claude-code
github.copilot
github.copilot-chat
saoudrizwan.claude-dev

# ============================================
# Git & GitHub
# ============================================
donjayamanne.githistory
eamodio.gitlens
github.vscode-github-actions
github.vscode-pull-request-github
mhutchie.git-graph
seatonjiang.gitmoji-vscode

# ============================================
# Docker & Containers
# ============================================
docker.docker
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers

# ============================================
# Remote Development
# ============================================
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server

# ============================================
# Python
# ============================================
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
njpwerner.autodocstring

# ============================================
# Jupyter
# ============================================
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# ============================================
# Go
# ============================================
golang.go

# ============================================
# Markdown
# ============================================
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
davidanson.vscode-markdownlint

# ============================================
# Other Languages & Formats
# ============================================
mechatroner.rainbow-csv
neilding.language-liquid
tamasfe.even-better-toml

# ============================================
# UI & Themes
# ============================================
jakobhoeg.vscode-pokemon
pkief.material-icon-theme
oderwat.indent-rainbow
wayou.vscode-todo-highlight

# ============================================
# Collaboration
# ============================================
ms-vsliveshare.vsliveshare

# ============================================
# Language Packs
# ============================================
ms-ceintl.vscode-language-pack-ja
