# Homebrew Bundle file
# Usage: brew bundle

# Tap repositories
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# ============================================
# Development Tools
# ============================================

# Git version control
brew "git"
brew "gh"  # GitHub CLI

# Shell utilities
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# Interactive filtering tool
brew "peco"

# Python version management
brew "pyenv"

# Modern Unix tools
brew "ripgrep"    # Better grep (rg)
brew "fd"         # Better find
brew "bat"        # Better cat with syntax highlighting
brew "exa"        # Better ls
brew "fzf"        # Fuzzy finder
brew "tree"       # Directory tree viewer
brew "jq"         # JSON processor
brew "yq"         # YAML processor

# Network tools
brew "curl"
brew "wget"

# Compression tools
brew "unzip"
brew "zip"

# ============================================
# Optional: Add your commonly used tools here
# ============================================

# AWS tools (uncomment if needed)
brew "awscli"
brew "aws-sam-cli"

# Google Cloud SDK (uncomment if needed)
brew "google-cloud-sdk"

